const SearchStrs = [
  // https://ja.wikipedia.org/wiki/%E3%83%8F%E3%83%AF%E3%82%A4%E3%81%AE%E6%AD%B4%E5%8F%B2
  `有史以前は太平洋を渡ってやってきたポリネシア人たちが持ち込んだ伝統を守りつつ生活を営んでいたが、1778年のジェームズ・クックによる「発見」以降、ハワイは近代化の波へ飲み込まれることとなる。島同士の内戦を経てハワイ王国という100年に及ぶ統一国家が確立し、欧米人との接触に伴って社会は急速に変容し始める。19世紀前半より宗教的基盤の確立と経済発展を求めた欧米入植者たちとその末裔は、次第に経済的安定を保障するための政治権力を欲するようになり、その影響は時代を経るにつれて強力なものとなっていった。サトウキビ農園とその交易による莫大な土地と富を手に入れた成功者たちは更なる産業発展を求めて安価な労働力を日本を中心とする様々な地域より大量に呼び込み、ハワイ社会は多くの人種が混合した複雑な文化を育んでいった。
白人勢力はやがてハワイ人国家を倒し、近代化の名の下に1900年にはアメリカ合衆国の領土として併合がなされた。さらに戦時下においては東西に台頭したアメリカと日本の確執の余波をまともに受け、太平洋上の重要な軍事拠点として開発が進む一方で、ハワイへ労働者としてやってきた大量の日本人移民は深刻な差別に曝された。現代は観光都市として発展を見せる一方で、開発による環境汚染、歴史遺構の破壊や人口増加による地価・物価の高騰、ハワイ人問題事務局が提唱しているハワイ人による自治権の獲得など、複数の問題を抱えている。ハワイは、その解決の糸口を模索しながら今日に至っている。`,
  // https://ja.wikipedia.org/wiki/%E4%BA%94%E7%A8%9C%E9%83%AD
  `五稜郭（ごりょうかく）は、江戸時代末期に江戸幕府により蝦夷地の箱館（現在の北海道函館市）郊外に建造された稜堡式の城郭である。同時期に築城された長野県佐久市の龍岡城も稜堡式城郭であり「五稜郭」と呼ばれるが[1]、単に「五稜郭」といえば函館の城郭とする場合も多い[注釈 1]。
  予算書時点から五稜郭の名称は用いられていた[3]が、築造中は、亀田役所土塁（かめだやくしょどるい）[4]または亀田御役所土塁（かめだおんやくしょどるい）[5]とも呼ばれた[注釈 2]。元は湿地でネコヤナギが多く生えていた土地であることから、柳野城（やなぎのじょう）の別名を持つ[6]。
  五稜郭は箱館開港時に函館山の麓に置かれた箱館奉行所の移転先として築造された。しかし、1866年（慶応2年）の完成からわずか2年後に幕府が崩壊、短期間箱館府が使用した後、箱館戦争で旧幕府軍に占領され、その本拠となった。明治に入ると郭内の建物は1棟を除いて解体され、陸軍の練兵場として使用された。その後、1914年（大正3年）から五稜郭公園として一般開放され、以来、函館市民の憩いの場とともに函館を代表する観光地となっている。
  国の特別史跡に指定され、「五稜郭と箱館戦争の遺構」として北海道遺産に選定されている。なお五稜郭は文化庁所管の国有財産[7]であり、函館市が貸与を受け、函館市住宅都市施設公社（指定管理者）が管理している[8]。`,
  // https://ja.wikipedia.org/wiki/%E3%83%A8%E3%83%BC%E3%82%AF%E3%82%BF%E3%82%A6%E3%83%B3%E3%81%AE%E6%88%A6%E3%81%84
  `ヨークタウンの戦い（Battle of Yorktown）は、1781年に起こったアメリカ独立戦争を事実上終結させた決定的な戦闘。
  バージニア植民地東岸のグレートブリテン王国（イギリス）軍最終拠点であったヨークタウンにて、米仏連合軍がチャールズ・コーンウォリス率いるイギリス軍約7,000を包囲、降伏させた。この戦いによって、アメリカ独立戦争における植民地軍の勝利は確定し、独立戦争は事実上の終結を見た。`,
  // https://ja.wikipedia.org/wiki/NEW_GAME!
  `ゲーム会社を舞台として、若い女性社員ばかりのチームに配属されたヒロインの日常・勤務生活を描く、4コマ漫画である。作者の得能は3年間、ゲーム会社に勤務した経験があり[1][2]、その経験が基になっている[1]。企画時には作者の辛い実体験に基づいた「ほのぼの社畜漫画」という路線が予定されていたものの[1]、連載が始まると登場人物たちの仲の良さに引っ張られ、予定よりも楽しげな作風で描かれることとなった[1]。ゲームソフトの開発環境やハードウェアの推移は移り変わりが激しく[注釈 1]、月刊誌連載のペースでは執筆から単行本に収録されるまでの間に情勢が変わってしまうことから、ゲームの時事ネタは扱わない方針で[3]、劇中におけるゲームの制作場面は普遍的な内容のみが描かれている[3]。
  物語の方向性は女性中心の人間関係を描くことに置かれており[3][4]、社会人ドラマ的な内容よりも、各話で特定のシチュエーションに置かれた登場人物がどうするかという内容を念頭に置いた話作りが指向されている[5]。物語は基本的にヒロインの視点で描かれているが[6]、本作では上司と部下という上下関係が軸となっており[7]、周囲の先輩社員から見た、初心を思い出させてくれる仲間としてのヒロインの姿を印象づける内容にもなっている[6]。基本的に性格の良い人物しか登場しないという作風になっているが[8]、主要な登場人物が学生のような仲良しグループとは異なり[9][7]、プロとしての責任を背負って人間関係のトラブルにも向き合わなければならない間柄であることも意識して描かれた[9]。一方、部分的には生々しい実体験に基づいたエピソードも盛り込んではいるが[注釈 2]、作者の実体験では失敗した事柄を主人公たちが円満に解決する形などに改変した上で反映されており[7]、ゲーム業界の悲惨なエピソードの暴露といった内容は避けられ[10]、残業や休日出勤を楽しんでこなすヒロインや[6]、キラキラとした[10]女性社会人たちの姿を、ほのぼのとした[11]作風で描いている。`,
  // https://ja.wikipedia.org/wiki/%E3%83%9D%E3%82%B1%E3%83%83%E3%83%88%E3%83%A2%E3%83%B3%E3%82%B9%E3%82%BF%E3%83%BC_(%E3%82%A2%E3%83%8B%E3%83%A1)
  `「ポケモンマスター」を目指す少年・サトシと、相棒のピカチュウをはじめとしたポケモンの成長を描いた物語とキャラクター性に焦点を当て、ゲーム版『ポケットモンスター 赤・緑』の発売から1年あまり経った1997年 (平成9年)4月1日から、テレビ東京系列で放送を開始した。
  開始当初はセル画で制作されていたが、2002年（平成14年）8月[注 6] より、デジタル制作に移行した。ただし、主題歌の映像などはそれ以前からデジタル化していた。『アドバンスジェネレーション』の後期からはポケモンの技などにCGが使用されるようになった。
  地上デジタルテレビ放送が全国に広がって以降も標準画質（画面比4:3）での制作が続いていたが、2009年 (平成21年)4月2日放送[注 6] 分からハイビジョン制作に移行した[1]。また、アナログ放送では2009年（平成21年）10月1日放送[注 6] からレターボックスでの放送に移行した。2012年（平成24年）1月5日放送からは連動データ放送[注 7] も開始されている。この他、テレビ東京系列（開始当初より）などでは字幕放送[注 8]を行っている。また、字幕放送で表示される技の名前は漢字を使用して、ワンセグ放送以外では上にふりがなをふっている（例：かえんほうしゃ→火炎放射など）。なお、一部の技は字幕放送では一部分だけひらがなで表示されることも稀にある。
  1997年（平成9年）12月16日の第38話『でんのうせんしポリゴン』の放送時には「ポケモンショック」が発生するが[注 9]、四か月の放送休止を乗り越えて放送は再開された。
  1998年（平成10年）夏には劇場版の第1作『ミュウツーの逆襲』を公開、同年に日本で公開された映画の興行成績第4位と興行収入72億4000万円を記録した[注 10]。その後も毎年7月中旬から夏休みにかけて劇場版が上映されている。
  2016年4月7日より、放送時間を5分繰り上げ、18:55 - 19:25の放送となった[3]。1998年4月に放送再開して以来、18年ぶりに放送時間が変更となる。
  2017年（平成29年）4月で放送開始から20周年を迎えた長寿番組であり、現在でもテレビ東京製作のアニメシリーズでは最長寿アニメ番組である。
  長い放送期間でスタッフの多くは変動しているが、総監督の湯山邦彦や劇伴担当の宮崎慎二等、放送開始当初から現在まで製作に携わっているスタッフもいる。劇中のナレーションは全シリーズ一貫して石塚運昇が担当。`,
];
const MAX = SearchStrs.length * 20000;

let measure = function(title, f, MAX) {
  let before = new Date();
  let result = 0;
  for(let i = 0; i < MAX; i++) {
    let str = SearchStrs[(i % SearchStrs.length)];
    if(f(str)){
      result++;
    }
  }
  title = (title+"                         ").substr(0,20);
  let timef = ((new Date()-before) * 1000 / MAX).toFixed(2);
  let time = ("          " + timef).substr(-10);
  console.log("method="+title+", time="+time+"μs/op, matches="+(result*100/MAX)+ "%");
};

measure("Normal", require("./normal.js"),MAX);
measure("Regex", require("./regex.js"),MAX*10);
measure("Naive Native Code", require("./naive.js"),MAX);
measure("Native StateMachine", require("./sm.js"),MAX*10);

