const sm = require("./sm.js");
const normal = require("./normal.js");

const SearchStrs = [
  // https://ja.wikipedia.org/wiki/%E3%83%8F%E3%83%AF%E3%82%A4%E3%81%AE%E6%AD%B4%E5%8F%B2
  `有史以前は太平洋を渡ってやってきたポリネシア人たちが持ち込んだ伝統を守りつつ生活を営んでいたが、1778年のジェームズ・クックによる「発見」以降、ハワイは近代化の波へ飲み込まれることとなる。島同士の内戦を経てハワイ王国という100年に及ぶ統一国家が確立し、欧米人との接触に伴って社会は急速に変容し始める。19世紀前半より宗教的基盤の確立と経済発展を求めた欧米入植者たちとその末裔は、次第に経済的安定を保障するための政治権力を欲するようになり、その影響は時代を経るにつれて強力なものとなっていった。サトウキビ農園とその交易による莫大な土地と富を手に入れた成功者たちは更なる産業発展を求めて安価な労働力を日本を中心とする様々な地域より大量に呼び込み、ハワイ社会は多くの人種が混合した複雑な文化を育んでいった。
白人勢力はやがてハワイ人国家を倒し、近代化の名の下に1900年にはアメリカ合衆国の領土として併合がなされた。さらに戦時下においては東西に台頭したアメリカと日本の確執の余波をまともに受け、太平洋上の重要な軍事拠点として開発が進む一方で、ハワイへ労働者としてやってきた大量の日本人移民は深刻な差別に曝された。現代は観光都市として発展を見せる一方で、開発による環境汚染、歴史遺構の破壊や人口増加による地価・物価の高騰、ハワイ人問題事務局が提唱しているハワイ人による自治権の獲得など、複数の問題を抱えている。ハワイは、その解決の糸口を模索しながら今日に至っている。`,
  // https://ja.wikipedia.org/wiki/%E4%BA%94%E7%A8%9C%E9%83%AD
  `五稜郭（ごりょうかく）は、江戸時代末期に江戸幕府により蝦夷地の箱館（現在の北海道函館市）郊外に建造された稜堡式の城郭である。同時期に築城された長野県佐久市の龍岡城も稜堡式城郭であり「五稜郭」と呼ばれるが[1]、単に「五稜郭」といえば函館の城郭とする場合も多い[注釈 1]。
  予算書時点から五稜郭の名称は用いられていた[3]が、築造中は、亀田役所土塁（かめだやくしょどるい）[4]または亀田御役所土塁（かめだおんやくしょどるい）[5]とも呼ばれた[注釈 2]。元は湿地でネコヤナギが多く生えていた土地であることから、柳野城（やなぎのじょう）の別名を持つ[6]。
  五稜郭は箱館開港時に函館山の麓に置かれた箱館奉行所の移転先として築造された。しかし、1866年（慶応2年）の完成からわずか2年後に幕府が崩壊、短期間箱館府が使用した後、箱館戦争で旧幕府軍に占領され、その本拠となった。明治に入ると郭内の建物は1棟を除いて解体され、陸軍の練兵場として使用された。その後、1914年（大正3年）から五稜郭公園として一般開放され、以来、函館市民の憩いの場とともに函館を代表する観光地となっている。
  国の特別史跡に指定され、「五稜郭と箱館戦争の遺構」として北海道遺産に選定されている。なお五稜郭は文化庁所管の国有財産[7]であり、函館市が貸与を受け、函館市住宅都市施設公社（指定管理者）が管理している[8]。`,
  // https://ja.wikipedia.org/wiki/%E3%83%A8%E3%83%BC%E3%82%AF%E3%82%BF%E3%82%A6%E3%83%B3%E3%81%AE%E6%88%A6%E3%81%84
  `ヨークタウンの戦い（Battle of Yorktown）は、1781年に起こったアメリカ独立戦争を事実上終結させた決定的な戦闘。
  バージニア植民地東岸のグレートブリテン王国（イギリス）軍最終拠点であったヨークタウンにて、米仏連合軍がチャールズ・コーンウォリス率いるイギリス軍約7,000を包囲、降伏させた。この戦いによって、アメリカ独立戦争における植民地軍の勝利は確定し、独立戦争は事実上の終結を見た。`
];
const MAX = 100000;

{
  let before = new Date();
  let result = 0;
  for(let i = 0; i < MAX; i++) {
    let str = SearchStrs[(Math.random() * SearchStrs.length) | 0];
    if(sm(str)){
      result++;
    }
  }
  console.log("[State Machine] Time: "+(new Date()-before)+"ms");
}

{
  let before = new Date();
  let result = 0;
  for(let i = 0; i < MAX; i++) {
    let str = SearchStrs[(Math.random() * SearchStrs.length) | 0];
    if(normal(str)){
      result++;
    }
  }
  console.log("[Normal] Time: "+(new Date()-before)+"ms");
}
